_posts/2016-06-16-three-logicians-walk-into-a-bar.html
---
date: 2016-06-16
tags: 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- dummy-tags-should-be-replaced
author: 
layout: post
title: Three logicians walk into a bar
excerpt: I overexplain a not particularly funny joke.
categories: 
- humor
featured: false
---
<p>
I had a fun exchange by text today. My father texted both my brother
and myself the following message "Did I borrow [a particular book]
from either of you?". This left me in a bit of a predicament; I don't
have the information to be able to answer his question. 
</p>

<p>
For those of you who are somewhat confused<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> by this, let
me explicate. The problem hinges on the word "either". Let's look at a
table.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Borrowed from me</td>
<td class="org-left">Not borrowed from me</td>
</tr>

<tr>
<td class="org-left">Borrowed from brother</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Not borrowed from brother</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>
</tbody>
</table>
<p>
Suppose we're in the first column and thus he did get the book from
me. Then I could answer "yes", and everything is fine<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
Now let's consider the case where I don't own the book. Now we're in
the other column. Certainly I know that he didn't borrow the book from
me. But I don't know what books my brother owns. Perhaps my brother
did have the book and my father borrowed it; in this case I should say
"yes". But perhaps my brother didn't have the book; in this case I
should say "no". I have two plausible scenarios with contradicting
responses; I can't respond.
</p>

<p>
In this situation I can only hope that my brother in fact owned the
book and replied "yes". Otherwise, we'd both be stuck unable to
respond. The question would go unanswered and it would stay in the
front of my mind. Because I can only keep track of <a href="https://en.wikipedia.org/wiki/The_Magical_Number_Seven,_Plus_or_Minus_Two">7 &plusmn; 2</a> things in
working memory, I would be working with at best 88% of my working
memory for the rest of my life. I'm a forgetful person at the best of
times, so with my diminished memory I'll probably forget to turn off
my stove and burn down my apartment complex. All because of a single
careless question.
</p>

<p>
Given that I'm not typing this from the smoking ruins of an apartment
building, apparently things were resolved. Fortunately I recalled an
old joke
</p>

<blockquote>
<p>
Three logicians walk into a bar. The barkeep says, "Do all of you want
a beer?"
</p>

<p>
The first logician says, "I don't know."
</p>

<p>
The second logician says, "I don't know."
</p>

<p>
The third logician says, "Yes!"
</p>
</blockquote>

<p>
So I replied back with an allusion to this joke and, to my eternal
pride, my brother (who studies math) figured it out and replied "no".
So there was a happy ending after all.
</p>

<p>
How did my joke reference help? Well, it gave my brother some
information. Namely, it told him that I didn't have enough information
to answer the question myself. The only case in which that's true is
when the book wasn't borrowed from me. This gave my brother the
information needed to confidently answer "no".
</p>

<p>
I'll leave it to the reader to figure out the connection with the joke.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Yes, I basically wrote this up to explain a joke to my father
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
I didn't think of this until writing this up, but there's an
unwarranted assumption lurking here. As a family, we've empirically
shown that the fact that a book is sitting on my shelf does not
prevent other family members from buying the same book. Thus, even if
I had a copy, I still couldn't be certain that my father had borrowed
it; he might have just bought it himself. There are, of course, no end
to these sorts of quibbles (see <a href="https://en.wikipedia.org/wiki/Philosophical_skepticism">philosophical skepticism</a>).
</p></div></div>


</div>
</div>
